#+TITLE: Purism Keys
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: 7th of May, 2019
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+NOSTARTUP: content
#+STARTUP: showeverything
#+NOPROPERTY: header-args:elisp+ :noweb-ref (concat "PROPERTY" "-ELISP")
#+NOPROPERTY: header-args:emacs-lisp+ :file-prop (concat "FILE" "-PROPERTY")
#+NOPROPERTY: header-args:tmate+ :noweb-ref (concat "PROPERTY" "SHELL")

* Advising Function
[[info:elisp#Advising%20Functions][info:elisp#Advising Functions]]

#+BEGIN_SRC elisp
  (defun this-tracing-function (orig-fun &rest args)
    ;; (edebug-tracing)
    (edebug-trace "ARGS: %S" args)
    (edebug-trace "1st Arg: %S" (pop (pop (pop args))))
    ;; (edebug-trace "2nd Arg: %S" (nth 1 (pop (pop args))))
    ;; (edebug-trace "FUN: %S" orig-fun)
    ;; (message "TRACE called with args %S" args)
    (let ((res (apply orig-fun args)))
      (message "TRACE returned %S" res)
      res))
  (ad-unadvise-all)
  (advice-add 'org-babel-process-params :around #'this-tracing-function)
  ;; (advice-add 'org-babel-merge-params :around #'this-tracing-function)
#+END_SRC

#+RESULTS:

org-babel-merge-params is where the functions get executed
[[info:elisp#Using%20Edebug][info:elisp#Using Edebug]]
open [[file:~/.emacs.d/elpa/26.2/develop/org-plus-contrib-20181126/ob-core.el::(defun%20org-babel-merge-params][ob-core.el::(org-babel-merge-params)]] then 'SPC u , e f' to eval defun with a prefix argument
Visit this line [[file:~/.emacs.d/elpa/26.2/develop/org-plus-contrib-20181126/ob-core.el::(pcase%20pair][ob-core.el::(pcase pair]] and hit '^x X b' to set edebug breakpoint
Run the elisp block to debug
c to continue
r to print resent result

#+BEGIN_SRC emacs-lisp :results code
(org-entry-properties)
;; (point) "header-args:emacs-lisp")
#+END_SRC

#+RESULTS:
#+BEGIN_SRC emacs-lisp
(("CATEGORY" . "org-babel")
 ("BLOCKED" . "")
 ("FILE" . "/home/hippie/ii/org/research/org-babel.org")
 ("PRIORITY" . "B")
 ("ITEM" . "Advising Function"))
#+END_SRC

#+BEGIN_SRC elisp :results code
(symbol-value 'org-special-properties)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC elisp
("ALLTAGS" "BLOCKED" "CLOCKSUM" "CLOCKSUM_T" "CLOSED" "DEADLINE" "FILE" "ITEM" "PRIORITY" "SCHEDULED" "TAGS" "TIMESTAMP" "TIMESTAMP_IA" "TODO")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(org-entry-get nil "ITEM")
#+END_SRC

#+RESULTS:
: Advising Function

#+BEGIN_SRC elisp
  (org-entry-get (point) "FILE")
  ;; # "header-args:emacs-lisp")
#+END_SRC

#+RESULTS:
: /home/hippie/ii/org/research/org-babel.org

#+BEGIN_SRC elisp :results code
(org-heading-components)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC elisp
(1 1 nil nil "Advising Function" nil)
#+END_SRC

#+BEGIN_SRC elisp :results code
(org-buffer-property-keys t)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC elisp
("ALLTAGS" "BLOCKED" "CLOCKSUM" "CLOCKSUM_T" "CLOSED" "DEADLINE" "FILE"
"header-args:emacs-lisp" "header-args:tmate" "ITEM" "PRIORITY" "SCHEDULED" "TAGS" "TIMESTAMP" "TIMESTAMP_IA" "TODO")
#+END_SRC

#+BEGIN_SRC elisp :results code :noweb-ref (concat "HEADER" "-ELISP")
  (org-entry-properties nil)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC elisp
(("CATEGORY" . "org-babel")
 ("BLOCKED" . "")
 ("FILE" . "/home/hippie/ii/org/research/org-babel.org")
 ("PRIORITY" . "B")
 ("ITEM" . "Advising Function"))
#+END_SRC


#+BEGIN_SRC elisp :results code :noweb-ref (concat "HEADER" "-ELISP")
  (org-babel-get-src-block-info)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC elisp
("elisp" "(org-babel-get-src-block-info)"
 ((:colname-names)
  (:rowname-names)
  (:result-params "code" "replace")
  (:result-type . value)
  (:results . "code replace")
  (:exports . "code")
  (:noweb-ref . "HEADER-ELISP")
  (:lexical . "no")
  (:tangle . "no")
  (:hlines . "no")
  (:noweb . "no")
  (:cache . "no")
  (:session . "none"))
 "" nil 13497 "(ref:%s)")
#+END_SRC


With a few items:

#+BEGIN_SRC elisp
("elisp" "(org-babel-get-src-block-info)"
 ((:colname-names)
  (:rowname-names)
  (:result-params "code" "replace")
  (:result-type . value)
  (:results . "code replace")
  (:exports . "code")
  (:noweb-ref . "HEADER-ELISP")
  (:dir-local-str . "(concat \"DIR\" \"-EMACS_LISP\")")
  (:dir-local-default-quote quote
                            (concat "DIR" "-EMACS_LISP"))
  (:dir-local-default-func concat "DIR" "-EMACS_LISP")
  (:tangle . "no")
  (:hlines . "no")
  (:noweb . "no")
  (:cache . "no")
  (:session . "none"))
 "" nil 13634 "(ref:%s)")
#+END_SRC

(:noweb-ref quote (concat "DIR" "-EMACS_LISP"))

#+BEGIN_SRC elisp
("elisp" "(org-babel-get-src-block-info)"
 ((:colname-names)
  (:rowname-names)
  (:result-params "code" "replace")
  (:result-type . value)
  (:results . "code replace")
  (:exports . "code")
  (:noweb-ref . "PROPERTY-ELISP")
  (:tangle . "no")
  (:hlines . "no")
  (:noweb . "no")
  (:cache . "no")
  (:session . "none"))
 "" nil 5479 "(ref:%s)")
#+END_SRC

